#+TITLE: Nix: The Good, The Bad, and The Useful

#+OPTIONS: toc:nil
#+REVEAL_HLEVEL: 2
#+REVEAL_PLUGINS: (highlight notes)

#+MACRO: lambda  $$ (\lambda s.\!p)(s) $$ 
#+MACRO: mastodon  Mastodon: @sehqlr@mastodon.technology
#+MACRO: slack  stl-tech.slack.com: @sehqlr
#+MACRO: myemail talks+nix@samhatfield.me

*** /nix/store
    all packages that are built by nix go into this directory

    YES, this breaks FHS, but we'll return to that in a few slides

    the directory template is =$hash-$name=, where hash is the hash from the build

    #+REVEAL: split
    #+begin_src sh :cache yes :results output :exports both
    nix path-info nixpkgs.curl
    #+end_src

    #+RESULTS[a0fd4c62f58d3e3553f1a942b94c2bb85df0c3e2]:
    : /nix/store/yb6s1k41s7sydr6q3nzmayhvbkzhydvf-curl-7.64.0-bin


*** Dependencies...
    are included within the package!

    #+BEGIN_NOTES
    There's a "wrapping" mechanism for compatibility with Nix

    In this case, each executable in this directory has a wrapped counterpart
    #+END_NOTES

    #+begin_src sh :cache yes :results output :exports both
    find $(nix path-info nixpkgs.emacs) -executable -type f -not -name '*wrapped'
    #+end_src

    #+RESULTS[2e81d8692a842a55f2771ae87644beecc9805450]:
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/movemail
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/rcs2log
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/profile
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/hexl
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/emacsclient
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/ctags
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/ebrowse
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/emacs-26.1
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/etags


    #+REVEAL: split
    This means that dependency tracking happens during the build step

    this mitigates the broken dependency problem because each package brings their own

*** install via symlink
    installs are done with symlinks from outside the store

    #+begin_src sh :cache yes :exports both :results output
    ls -l $(which curl)
    #+end_src

    #+RESULTS[012eda994d813485683ef3855f39f0bb981c3f6b]:
    : lrwxrwxrwx 1 root root 68 Dec 31  1969 /run/current-system/sw/bin/curl -> /nix/store/nakc4z4vz69sq2jjlakp64s04qgggvja-curl-7.64.1-bin/bin/curl


    Because you can symlink anywhere, we can reestablish FHS via symlinks. NixOS
    doesn't, but you could!

    BTW, Nix resets all timestamps, that's why the file is so old

*** it's a file!
    surprise!
    #+ATTR_REVEAL: :frag roll-in
    it's JSON
    #+REVEAL: split
     #+begin_src sh :cache yes :results output :exports both
     nix show-derivation nixpkgs.jq | nix-shell -p jq --run jq | head -n10
     #+end_src

     #+RESULTS[3988edb7db005fefa02ba7cae57fd63e085cedb2]:
     #+begin_example
     {
       "/nix/store/7g5n296kyk2n11bki54cwpn2n27x597z-jq-1.6.drv": {
         "outputs": {
           "bin": {
             "path": "/nix/store/czdpwxms57dqqv4vixcx6pg6xl8lmsjv-jq-1.6-bin"
           },
           "dev": {
             "path": "/nix/store/zbrd5iga16dagl99bkk8y354rxvsrpqg-jq-1.6-dev"
           },
           "doc": {
     #+end_example


    #+BEGIN_NOTES
    I'm creating a subshell that has jq in the env, running it, to pretty-print
    the JSON of it's derivation. Are you not impressed??
    #+END_NOTES

*** derivation keys
    #+begin_src sh :cache yes :results output :exports both
     nix show-derivation nixpkgs.jq | nix-shell -p jq --run "jq '.[] | keys'"
    #+end_src

    #+RESULTS[56af2c3d7a38ecc1a1c93c0bb6162349f8f92ef1]:
    : [
    :   "args",
    :   "builder",
    :   "env",
    :   "inputDrvs",
    :   "inputSrcs",
    :   "outputs",
    :   "platform"
    : ]

    A derivation contains all the information that Nix needs to build a package

    #+REVEAL: split
    Here is where dependency tracking happens: =inputDrvs=
    #+begin_src sh :cache yes :exports both :results output
     nix show-derivation nixpkgs.jq | nix-shell -p jq --run "jq '.[].inputDrvs'"
    #+end_src

    #+RESULTS[6b9a0b80a19f89ee717755b0d23bc037c47f07d1]:
    #+begin_example
    {
      "/nix/store/0si75icim8ajxcsp25d9c52m42kqg1xj-stdenv-linux.drv": [
        "out"
      ],
      "/nix/store/1kircip4wskspsqqzxbmh6ss73iqh9ah-bash-4.4-p23.drv": [
        "out"
      ],
      "/nix/store/4ss7qn4n2nrc0r98ly33hw7s3brvwgcb-jq-1.6.tar.gz.drv": [
        "out"
      ],
      "/nix/store/9gg731fwsxxrl2qmwb17aq4w5r8s5l76-onig-6.9.1.drv": [
        "out"
      ]
    }
    #+end_example


    #+BEGIN_NOTES
    That =stdenv-linux.drv= is the =build-essentials=-alike I mentioned earlier
    #+END_NOTES

*** nix env generations
    Nix has this mechanism called /generations/ where each iteration of an
    update to an environment is tracked by entries in the store

    This means that, in a basic sense, your package actions are version
    controlled.

    #+begin_src sh :cache yes :results output :exports both
    nix-env --list-generations | tail -n5
    #+end_src

    #+RESULTS[82a82d80621c3024afbcbfc12cc253b1de21d013]:
    :  163   2019-04-28 14:49:06   
    :  164   2019-04-28 14:51:55   
    :  165   2019-04-28 17:32:00   
    :  166   2019-05-02 12:18:02   
    :  167   2019-05-02 15:04:45   (current)


    #+REVEAL: split

    And now you will hear my tale of woe... and hope
    
    #+BEGIN_NOTES
    LAPTOP WIFI STORY
    - happened this month
    - changing config to make my setup behave like a nixos module
    - made a change that didn't include networkmanager
    - before, I'd move the laptop to connect to the router via Ethernet
    - but this time, I realized that I could do a rollback
    - rebooted, selected the GRUB entry that I wanted, and BAM! Wifi works
    - that was it!
    - I fixed the config, tested this time, and was able to move forward without losing wifi again
    #+END_NOTES

*** per-user package management
    because each user get's their own environment with their own generations,
    each user can manage their own packages *without sudo*
    
    #+begin_src sh :cache yes :results output :exports both
    ls -l ~/.nix-profile
    #+end_src

    #+RESULTS[5e46fed652524af1762817860d845f037b1c1344]:
    : lrwxrwxrwx 1 sam users 42 Dec 13 20:06 /home/sam/.nix-profile -> /nix/var/nix/profiles/per-user/sam/profile


*** nix-shell
    Nix comes with a command that can load in a set of packages on demand into a subshell
    #+begin_src sh :cache yes :results output :exports both
    which ruby || echo "no ruby"
    nix-shell -p ruby --run 'which ruby || echo "no ruby"'
    #+end_src

    #+RESULTS[c927d0a65b73ff2dacc9cfeb6a1cedf068fd597d]:
    : no ruby
    : /nix/store/rwp5fpzqssf5m9dzbgbwsfgdzw8xajra-ruby-2.5.5/bin/ruby


    which means...
    #+REVEAL: split
    SANDBOXES FOR EVERYTHING, no containers required

    Nix comes with tooling to manage this, specifically =nix-shell=

    more on that later

*** dynamically typed
    types are checked at runtime
    #+begin_src sh :results output :session *nix repl* :cache no :exports both
    1 + 1
    "a" + 1
    #+end_src

    #+RESULTS:
    : 1 + 1
    : 2
    : "a" + 1
    : error: cannot coerce an integer to a string, at (string):1:1
    : echo 'org_babel_sh_eoe'


     #+BEGIN_NOTES
     I'm using an org-babel session to evaluation the nix code since
     spacemacs doesn't have a nix repl feature that I'm aware of, so I guess the
     echo part is with us for the remainder of this trip
     #+END_NOTES
**** equality operators (also for booleans)
     - ==== equality 
     - =!== inequality
     - no function counterparts for these
   #+REVEAL: split
    #+begin_src sh :session *nix repl* :results output :cache no :exports both
    1 + 2 - 3 * 4 / 5.0
    map (builtins.mul 1.0e4) [1 2 3 4]
    #+end_src

    #+RESULTS:
    : 1 + 2 - 3 * 4 / 5.0
    : 0.6
    : map (builtins.mul 1.0e4) [1 2 3 4]
    : [ 10000 20000 30000 40000 ]
    : echo 'org_babel_sh_eoe'


***** logical implication =->= (=!x || y=)
      #+begin_src sh :session *nix repl* :results output :cache no :exports both
      true -> 1 < 3
      #+end_src

      #+RESULTS:
      : true
      : echo 'org_babel_sh_eoe'

*** null
    =:t= is a REPL command that prints out the type of an expression

    #+begin_src sh :session *nix repl* :results output :cache no :exports both
    :t null
    #+end_src

    #+RESULTS:
    : null
    : echo 'org_babel_sh_eoe'

    
    The builtin function =typeOf= also does this

*** with-expressions
    dynamic scoping
    #+begin_src sh :session *nix repl* :results output :cache no :exports both
    with builtins; map (mul 2) (genList (x: x*x) 7) 
    :a builtins # :a is a repl command that brings a set's attrs into scope
    readDir (dirOf (getEnv "HOME"))
    :r # :r reloads all the files
    #+end_src

    #+RESULTS:
    #+begin_example
    with builtins; map (mul 2) (genList (x: x*x) 7) 
    [ 0 2 8 18 32 50 72 ]
    :a builtins # :a is a repl command that brings a set's attrs into scope
    Added 101 variables.
    readDir (dirOf (getEnv "HOME"))
    { guest = "directory"; sam = "directory"; }
    :r # :r reloads all the files
    '...
    Added 10135 variables.
    echo 'org_babel_sh_eoe'
    #+end_example

**** operations
     #+begin_src sh :session *nix repl* :cache no :results output :exports both
     :a builtins
     fromJSON ''{"x": [1, 2, 3], "y": null}''
     hashString "sha256" "moose and squirrel"
     match "ab" "abc"
     match "abc" "abc"
     match "a(b)(c)" "abc"
     :r
     #+end_src

     #+RESULTS:
     #+begin_example
     :a builtins
     Added 101 variables.
     fromJSON ''{"x": [1, 2, 3], "y": null}''
     { x = [ ... ]; y = null; }
     hashString "sha256" "moose and squirrel"
     "ea48540bf8671e37d7e5d3d0b0fea6a0b6b37d06fc977b773a24b52997f036f5"
     match "ab" "abc"
     null
     match "abc" "abc"
     [ ]
     match "a(b)(c)" "abc"
     [ "b" "c" ]
     :r
     '...
     Added 10135 variables.
     echo 'org_babel_sh_eoe'
     #+end_example

** Version string operations
   There are more but here is a sample
  #+begin_src sh :session *nix repl* :cache no :results output :exports both
  :a builtins
  compareVersions "1.2.3" "1.2.3"
  compareVersions "1.2.1" "1.2.3"
  compareVersions "1.2.5" "1.2.3"
  splitVersion "1.2.3"
  :r
  #+end_src

  #+RESULTS:
  #+begin_example
  :a builtins
  Added 101 variables.
  compareVersions "1.2.3" "1.2.3"
  0
  compareVersions "1.2.1" "1.2.3"
  -1
  compareVersions "1.2.5" "1.2.3"
  1
  splitVersion "1.2.3"
  [ "1" "2" "3" ]
  :r
  '...
  Added 10135 variables.
  echo 'org_babel_sh_eoe'
  #+end_example

**** operations
     #+begin_src sh :session *nix repl* :cache no :results output :exports both
     :a builtins
     baseNameOf /nix/store
     dirOf /nix/store
     :r
     #+end_src

     #+RESULTS:
     #+begin_example
     :a builtins
     Added 101 variables.
     baseNameOf /nix/store
     "store"
     dirOf /nix/store
     /nix
     :r
     '...
     Added 10135 variables.
     echo 'org_babel_sh_eoe'
     #+end_example


     Why are those two not symmetrical???
     
*** zero indexed, square brackets, no commas
    #+begin_src sh :session *nix repl* :results output :cache no
    [ 1 2 3 4 ]
    #+end_src

    #+RESULTS:
    : [ 1 2 3 4 ]
    : echo 'org_babel_sh_eoe'


*** heterogenous
    #+begin_src sh :session *nix repl* :results output :cache no
    [ "foo" 73.1 [ "hello" "world" ] ]
    #+end_src

    #+RESULTS:
    : [ "foo" 73.1 [ ... ] ]
    : echo 'org_babel_sh_eoe'


*** access attributes with =.= syntax
    #+begin_src sh :session *nix repl* :cache no :results output :exports both
    let S = { x = 123; foo = "bar"; }; in S.x
    #+end_src

    #+RESULTS:
    : 123
    : echo 'org_babel_sh_eoe'


    #+REVEAL: split
    OR, return a default
    #+begin_src sh :session *nix repl* :cache no :results output :exports both
    { x = 123; foo = "bar"; }.y or "default!"
    #+end_src

    #+RESULTS:
    : "default!"
    : echo 'org_babel_sh_eoe'
    
    This is the only time that =or= makes an appearance


*** merge or =//=
    #+begin_src sh :session *nix repl* :cache no :results output :exports both
    { sound = 0; dog = "good"; } // { sound = "BARK BARK"; }
    #+end_src

    #+RESULTS:
    : { dog = "good"; sound = "BARK BARK"; }
    : echo 'org_babel_sh_eoe'

    
**** dynamic =hasAttr=
     takes an expression
     
    #+begin_src sh :session *nix repl* :cache no :results output :exports both
    :a builtins
    { x = 123; dog = "good"; } ? dog
    hasAttr (head ["x"]) { x = 123; dog = "good"; }
    { x = 123; dog = "good"; } ? (head ["x"])
    
    :r
    #+end_src

    #+RESULTS:
    #+begin_example
    :a builtins
    Added 101 variables.
    { x = 123; dog = "good"; } ? dog
    true
    hasAttr (head ["x"]) { x = 123; dog = "good"; }
    true
    { x = 123; dog = "good"; } ? (head ["x"])
    error: syntax error, unexpected '(', expecting ID or OR_KW or DOLLAR_CURLY or '"', at (string):1:30

    :r
    '...
    Added 10135 variables.
    echo 'org_babel_sh_eoe'
    #+end_example

*** Recursive sets
    normal sets don't have internal scope?
    #+begin_src sh :session *nix repl* :cache no :results output :exports both
    { x = y; y = 123; }.x
    let y = "yogurt"; in { x = y; y = 123; }.x
    rec {x = y; y = 123;}.x
    #+end_src

    #+RESULTS:
    : { x = y; y = 123; }.x
    : error: undefined variable 'y' at (string):1:7
    : let y = "yogurt"; in { x = y; y = 123; }.x
    : "yogurt"
    : rec {x = y; y = 123;}.x
    : 123
    : echo 'org_babel_sh_eoe'


*** partial application
    #+begin_src sh :session *nix repl* :cache no :results output :exports both
    :t builtins.add 1
    #+end_src

    #+RESULTS:
    : the partially applied built-in function 'add'
    : echo 'org_babel_sh_eoe'


*** So, why use Dhall at all?
    Well, for one thing, it integrates with the existing Nix system

    it comes with a CLI tool for compiling

    src_sh[:eval no :exports code]{nix-shell -p dhall-nix}

    #+REVEAL: split
    #+begin_src sh :results output :cache yes :exports results
    nix-shell -p dhall-nix 2>&1 | tail -n16
    echo
    #+end_src

    #+RESULTS[5e5f35b7ea773d1f67d4eda8cd5a0ea653d5ad0d]:
    #+begin_example
    [41 of 45] Compiling Nix.Thunk.Standard ( src/Nix/Thunk/Standard.hs, dist/build/Nix/Thunk/Standard.o )
    [42 of 45] Compiling Nix.XML          ( src/Nix/XML.hs, dist/build/Nix/XML.o )
    [43 of 45] Compiling Nix.Builtins     ( src/Nix/Builtins.hs, dist/build/Nix/Builtins.o )

    src/Nix/Builtins.hs:96:51: error:
        Module
        ‘System.Nix.Internal.Hash’
        does not export
        ‘printHashBytes32’
       |
    96 | import           System.Nix.Internal.Hash       ( printHashBytes32 )
       |                                                   ^^^^^^^^^^^^^^^^
    [45 of 45] Compiling Paths_hnix       ( dist/build/autogen/Paths_hnix.hs, dist/build/Paths_hnix.o )
    builder for '/nix/store/m9l9pwaivpzda5vl66rix9kmsxx0k41a-hnix-0.6.0.drv' failed with exit code 1
    cannot build derivation '/nix/store/jwgwm2gmnmkv4nn95g3clc26fvgj12hy-dhall-nix-1.1.6.drv': 1 dependencies couldn't be built
    error: build of '/nix/store/jwgwm2gmnmkv4nn95g3clc26fvgj12hy-dhall-nix-1.1.6.drv' failed

    #+end_example

    #+BEGIN_NOTES
    I ran out of time to really fix this while prepping for this talk, I should
    write a follow up on this part

    FYI: it's currently marked as broken, so I was warned
    #+END_NOTES
*** lets build it!
  src_sh[:eval no :exports code]{nix build}
  #+REVEAL: split
  #+begin_src sh :results value verbatim :cache yes :exports results
  nix build -f default.err.nix 2>&1
  echo
  #+end_src

  #+RESULTS[8877723ebc94c5cb63133d1bcb8552ee0e40881a]:
  #+begin_example
  builder for '/nix/store/8wgwpvh5wh2v145mdfz60g9rcpybcrcy-npiet-1.3e.drv' failed with exit code 2; last 10 log lines:
    npiet.c:2234:7: warning: variable 'pre_xpos' set but not used [-Wunused-but-set-variable]
       int pre_xpos, pre_ypos;
           ^~~~~~~~
    gcc -g  -o npiet npiet.o -lm 
    gcc -g -O2    -Wall -DHAVE_CONFIG_H   -c npiet-foogol.c
    npiet-foogol.y:50:10: fatal error: gd.h: No such file or directory
     #include <gd.h>
              ^~~~~~
    compilation terminated.
    make: *** [Makefile:100: npiet-foogol.o] Error 1
  error: build of '/nix/store/8wgwpvh5wh2v145mdfz60g9rcpybcrcy-npiet-1.3e.drv' failed

  #+end_example

*** will it build?
    #+begin_src sh :exports both :results output :cache yes
    nix-build && find result -executable -type f
    nix-env -i -f .
    npiet Piet_hello.png
    #+end_src

    #+RESULTS[b3272265c517e8665ed6aa8bbd4f4618ff76927d]:
    : /nix/store/9v03fb58vvp3r7mjlzymy3m0mmsqrnqk-npiet-1.3e
    : Hello world!

 
*** cleaning up 
    I wrote this to reset the env for the slidedeck, but it also demos the
    garbage collector
    #+begin_src sh :exports both :results output :cache yes
    nix-env -e -f .
    rm result && nix-collect-garbage
    #+end_src

    #+RESULTS[70f72eeadb1032063b0a448b0d15383a0b18d50e]:
    : 1138 store paths deleted, 919.07 MiB freed


